app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
	def authenticate_request
		header = request.headers["token"]
		header = header.split(" ").last if header
		begin
		   @decoded = JsonWebToken.decode(header)
		   @current_user = User.find_by(id: @decoded[:user_id])