app/controllers/comments_controller.rb

	def create
		debugger

		@comment = @post.comments.new(comment_params)
		@comment.user = @current_user
		if @comment.save
---
INSERT INTO "comments" ("comment", "created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "jai ho"], ["created_at", "2024-03-15 10:17:01.214080"], ["updated_at", "2024-03-15 10:17:01.214080"], ["user_id", 1], ["post_id", 4]]