app/controllers/posts_controller.rb

	def create
         debugger
		@post = @current_user.posts.new(post_params)
		if @post.save
---
INSERT INTO "posts" ("title", "content", "publication_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"