app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
   def create
      debugger
    @user = User.new(user_params)
      if @user.save